<a href="https://colab.research.google.com/github/shruthi-jay/pandas/blob/main/pytho.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

                                                     CREATING DATAFRAME USING DIFFERENT METHODS

A Pandas DataFrame is a 2 dimensional data structure, like a 2 dimensional array, or a table with rows and columns.There are many ways of creating a dataframe. Few ways to create a dataframe are :

1.Create an empty DataFrame
    
     a)without any column name or indices and then appending columns one by one to it.

In [5]:
# importing the pandas library  
import pandas as pd  
df = pd.DataFrame()  
print (df)  
df['Pokemon'] = ['Charmander', 'Pikachu', 'Squirtle']
df['Type'] = ['Fire','Electric','Water']
df['Hp'] = [58, 35, 44]
df

Empty DataFrame
Columns: []
Index: []

      Pokemon      Type  Hp
0  Charmander      Fire  58
1     Pikachu  Electric  35
2    Squirtle     Water  44

        b) with columns name only then appending rows one by one to it using append() method.

In [13]:
import pandas as pd
  
# create an Empty DataFrame
# object With column names only
df = pd.DataFrame(columns = ['Nam', 'Type', 'Total'])
print(df)
# append rows to an empty DataFrame
df = df.append({'Nam':'Bulbasaur','Type':'Grass','Total':318},ignore_index = True)
df = df.append({'Nam':'Ivysaur','Type':'Grass','Total':405},ignore_index = True)
df = df.append({'Nam':' Venusaur','Type':'Grass','Total':525},ignore_index = True)
df

Empty DataFrame
Columns: [Nam, Type, Total]
Index: []

         Nam   Type Total
0  Bulbasaur  Grass   318
1    Ivysaur  Grass   405
2   Venusaur  Grass   525

      c)with a column name and indices and then appending rows one by one to it using loc[] method

In [20]:
import pandas as pd
  
# create an Empty DataFrame object With
# column names and indices 
df = pd.DataFrame(columns = ['Hero', 'Agility', 'Accelerated Healing'], 
                   index = ['a', 'b', 'c'])
  
print("Empty DataFrame\n", df)
  
# adding rows to an empty 
# dataframe at existing index
df.loc['a'] = [' 3-D Man','True','False']
df.loc['b'] = ['A-Bomb','False','True']
df.loc['c'] = ['Abe Sapien','True','True']
df

Empty DataFrame
   Hero Agility Accelerated Healing
a  NaN     NaN                 NaN
b  NaN     NaN                 NaN
c  NaN     NaN                 NaN

         Hero Agility Accelerated Healing
a     3-D Man    True               False
b      A-Bomb   False                True
c  Abe Sapien    True                True

2) Create DataFrame using List

    a)with index and column names